app/views/groups/index.html.erb

SELECT COUNT(*) FROM "members" WHERE "members"."group_id" = $1  [["group_id", 1]]
---
      </h2>
      <p>Members: <%= group.members.count %></p>