app/views/groups/show.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]
---
<% else %>
  <h3>Created By: <%= @group.user.first_name %> <%= @group.user.last_name %></h3>

SELECT "members".* FROM "members" WHERE "members"."group_id" = $1  [["group_id", 1]]
---
<h3>Members:</h3>
<% @group.members.each do |member| %>