app/controllers/groups_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]
SELECT "groups".* FROM "groups"
---
  def index
    @user = User.find_by_id(session[:user_id])
    @groups = Group.all

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]
SELECT  "groups".* FROM "groups" WHERE "groups"."id" = $1 LIMIT 1  [["id", 1]]
SELECT "members".* FROM "members" WHERE "members"."group_id" = $1 AND "members"."user_id" = $2  [["group_id", 1], ["user_id", 1]]
---
  def show
    @user = User.find_by_id(session[:user_id])
    @group = Group.find(params[:id])
    if @group.members.where(user:@user)[0]

INSERT INTO "groups" ("name", "description", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Test"], ["description", "testing group"], ["user_id", 1], ["created_at", "2016-10-25 19:30:19.396467"], ["updated_at", "2016-10-25 19:30:19.396467"]]
---
  def create
    group =Group.new(name:params[:group][:name], description:params[:group][:description], user_id:session[:user_id])
    if group.save

SELECT  "groups".* FROM "groups" WHERE "groups"."id" = $1 LIMIT 1  [["id", 2]]
DELETE FROM "groups" WHERE "groups"."id" = $1  [["id", 2]]
---
  def destroy
    group = Group.find(params[:id])
    group.destroy