app/controllers/members_controller.rb

  def create
    Member.create(user:User.find(session[:user_id]), group:Group.find(params[:id]))
---
INSERT INTO "members" ("user_id", "group_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 1], ["group_id", 1], ["created_at", "2016-10-25 20:37:54.791017"], ["updated_at", "2016-10-25 20:37:54.791017"]]
SELECT  "groups".* FROM "groups" WHERE "groups"."id" = $1 LIMIT 1  [["id", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]

  def destroy
    member = Member.find(params[:id])
    member.destroy
---
SELECT  "members".* FROM "members" WHERE "members"."id" = $1 LIMIT 1  [["id", 1]]
DELETE FROM "members" WHERE "members"."id" = $1  [["id", 1]]