app/controllers/sessions_controller.rb

  def create
    user = User.find_by_email(params[:Email])
---
SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT 1  [["email", "john@rambo.com"]]